# Imports

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
data_df =  pd.read_excel('dog_treats_data.xlsx')

In [3]:
data_df.head()

   sample_no   x1   x2   x3   x4   x5
0          1  224  220  221  222  224
1          2  222  220  221  223  223
2          3  223  221  224  224  221
3          4  223  221  223  223  223
4          5  223  221  221  223  220

In [4]:
data_df.shape

(24, 6)

In [5]:
trans_df=data_df.T
trans_df.head()

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
sample_no,1,2,3,4,5,6,7,8,9,10,...,16,17,18,19,20,21,22,23,24,25
x1,224,222,223,223,223,223,221,221,222,223,...,223,220,222,223,224,224,222,222,221,220
x2,220,220,221,221,221,223,220,223,228,222,...,220,220,223,224,220,220,224,223,220,221
x3,221,221,224,223,221,224,222,220,221,220,...,220,220,222,224,221,221,220,224,223,224
x4,222,223,224,223,223,222,220,223,220,222,...,220,220,223,222,222,221,221,221,222,221

In [6]:
trans_df.describe()

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
count,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.00000,6.000000,6.000000,6.000000,...,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000
mean,185.333333,185.166667,186.000000,186.166667,185.500000,187.000000,185.50000,186.500000,187.166667,186.500000,...,186.833333,186.833333,188.166667,189.166667,188.333333,188.166667,188.500000,189.500000,188.833333,188.833333
std,90.318695,89.740552,89.661586,89.246662,88.434722,88.674686,87.45456,87.459133,87.327926,86.472539,...,83.700458,83.216385,83.367660,83.367660,82.478280,81.905840,81.578796,81.576345,80.759932,80.273076
min,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.00000,8.000000,9.000000,10.000000,...,16.000000,17.000000,18.000000,19.000000,20.000000,21.000000,22.000000,23.000000,24.000000,25.000000
25%,220.250000,220.250000,221.000000,221.500000,220.250000,222.250000,220.00000,220.250000,220.250000,220.500000,...,220.000000,220.000000,221.250000,222.250000,220.250000,220.250000,220.250000,221.250000,220.250000,220.250000
50%,221.500000,221.500000,222.000000,223.000000,221.000000,223.000000,220.50000,222.000000,221.500000,222.000000,...,220.000000,220.000000,222.000000,223.000000,221.500000,221.000000,221.500000,222.500000,221.500000,221.000000
75%,223.500000,222.750000,223.750000,223.000000,222.500000,223.750000,221.75000,223.000000,222.750000,222.000000,...,221.500000,220.000000,222.750000,223.750000,222.750000,221.750000,222.000000,223.750000,222.750000,221.750000
max,224.000000,223.000000,224.000000,223.000000,223.000000,224.000000,223.00000,224.000000,228.000000,223.000000,...,223.000000,224.000000,223.000000,224.000000,224.000000,224.000000,224.000000,224.000000,223.000000,224.000000

In [7]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, sample_no to x5
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      int64
 1   1       6 non-null      int64
 2   2       6 non-null      int64
 3   3       6 non-null      int64
 4   4       6 non-null      int64
 5   5       6 non-null      int64
 6   6       6 non-null      int64
 7   7       6 non-null      int64
 8   8       6 non-null      int64
 9   9       6 non-null      int64
 10  10      6 non-null      int64
 11  11      6 non-null      int64
 12  12      6 non-null      int64
 13  13      6 non-null      int64
 14  14      6 non-null      int64
 15  15      6 non-null      int64
 16  16      6 non-null      int64
 17  17      6 non-null      int64
 18  18      6 non-null      int64
 19  19      6 non-null      int64
 20  20      6 non-null      int64
 21  21      6 non-null      int64
 22  22      6 non-null      int64
 23  23      6 non-null      int64
dtypes: int64(24)
memory usage: 1.3+ KB

In [8]:
data_df.head()

   sample_no   x1   x2   x3   x4   x5
0          1  224  220  221  222  224
1          2  222  220  221  223  223
2          3  223  221  224  224  221
3          4  223  221  223  223  223
4          5  223  221  221  223  220

In [10]:
data_df.columns

Index(['sample_no', 'x1', 'x2', 'x3', 'x4', 'x5'], dtype='object')

In [9]:
observation_labels = []

for col in data_df.columns:
    if col[0] =='x':
        observation_labels.append(col)
observation_labels

['x1', 'x2', 'x3', 'x4', 'x5']

### Calculate x - mean for each row

In [12]:
data_df['x_mean'] = data_df.loc[:,observation_labels].mean(axis=1)
data_df.head()

   sample_no   x1   x2   x3   x4   x5  x_mean
0          1  224  220  221  222  224   222.2
1          2  222  220  221  223  223   221.8
2          3  223  221  224  224  221   222.6
3          4  223  221  223  223  223   222.6
4          5  223  221  221  223  220   221.6

### Calculate Range for each row

In [13]:
data_df['R']= data_df.loc[:,observation_labels].max(axis=1) - data_df.loc[:,observation_labels].min(axis=1)
data_df.head()

   sample_no   x1   x2   x3   x4   x5  x_mean  R
0          1  224  220  221  222  224   222.2  4
1          2  222  220  221  223  223   221.8  3
2          3  223  221  224  224  221   222.6  3
3          4  223  221  223  223  223   222.6  2
4          5  223  221  221  223  220   221.6  3

### Calculate x-bar-bar

In [15]:
x_bar_bar = data_df['x_mean'].mean()
x_bar_bar

222.17499999999998

### Calculate Range Mean

In [17]:
R_mean  =  data_df['R'].mean()
R_mean

3.5

## Calculate UCL and LCL

Import factors

In [18]:
factors_df = pd.read_csv('factors.csv')
factors_df.head()

   sample_size     A2     A3     d2   D3     D4    B3     B4
0            2  1.880  2.659  1.128  0.0  3.267  0.00  3.267
1            3  1.023  1.954  1.693  0.0  2.574  0.00  2.568
2            4  0.729  1.628  2.059  0.0  2.282  0.00  2.266
3            5  0.577  1.427  2.326  0.0  2.114  0.00  2.089
4            6  0.483  1.287  2.534  0.0  2.004  0.03  1.970

In [20]:
n = len(observation_labels)
n

5

Find a2

In [21]:
factors_df.loc[factors_df['sample_size']==n]

   sample_size     A2     A3     d2   D3     D4   B3     B4
3            5  0.577  1.427  2.326  0.0  2.114  0.0  2.089

In [22]:
A2 = factors_df.loc[factors_df['sample_size']==n]['A2'].values[0]
A2

0.577